app/controllers/concerns/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "4rd post "], ["content", "user testing"], ["created_at", "2019-11-03 22:10:44.519078"], ["updated_at", "2019-11-03 22:10:44.519078"], ["user_id", 3]]
---
	def create
	@post = current_user.posts.build(post_params)

	if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", ""], ["content", "content"], ["updated_at", "2019-11-04 10:52:54.871917"], ["id", 1]]
---
	def update
	@post = Post.find(params[:id])

	if @post.update(post_params)